//--------------------------------------------------------------
//! @file   DebugLine.ps.hlsl
//! @brief  デバッグライン用のピクセルシェーダ
//! @author 山﨑愛
//--------------------------------------------------------------

//--------------------------------------------------------------
//! @brief シーン定数バッファ
//--------------------------------------------------------------
struct PSInput
{
    float4 Position : SV_POSITION;
    float4 Color : COLOR;
};

//--------------------------------------------------------------
//! @brief デバッグライン用ピクセルシェーダ
//! @param input [in] 頂点シェーダーからの出力
//! @return ピクセルカラー
//--------------------------------------------------------------
float4 PSMain(PSInput input) : SV_TARGET
{
    return input.Color;
}
