//--------------------------------------------------------------
//! @file   Log.h
//! @brief  ログ出力クラスの宣言
//! @author 山﨑愛
//--------------------------------------------------------------
#pragma once
// 名前空間 : Tsukino::Core
namespace Tsukino::Core {
    //--------------------------------------------------------------
    //! @class   Log
    //! @brief   ログ出力クラス
    //! @details ログレベルに応じてコンソールにメッセージを出力するクラス
    //--------------------------------------------------------------
    class Log {
    public:
        //--------------------------------------------------------------
        // ログ出力関数
        //! @param msg 出力するメッセージ
        //--------------------------------------------------------------
        static void Info(const std::string& msg);

        //--------------------------------------------------------------
        // 警告ログ出力関数
        //! @param msg 出力するメッセージ
        //--------------------------------------------------------------
        static void Warn(const std::string& msg);

        //--------------------------------------------------------------
        // エラーログ出力関数
        //! @param msg 出力するメッセージ
        //--------------------------------------------------------------
        static void Error(const std::string& msg);
    };
}    // namespace Tsukino::Core
