//--------------------------------------------------------------
//! @file   Path.hpp
//! @brief  パス管理クラスの宣言
//! @author 山﨑愛
//--------------------------------------------------------------
#pragma once
#include <string>
#include <filesystem>
// 名前空間 : Tsukino::Core
namespace Tsukino::Core {
    //--------------------------------------------------------------
    //! @class   Path
    //! @brief   パス管理クラス
    //--------------------------------------------------------------
    class Path {
    public:
        //--------------------------------------------------------------
        //! @brief   コンストラクタ
        //--------------------------------------------------------------
        Path() = default;

        //--------------------------------------------------------------
        //! @brief   コンストラクタ
        //! @param   path [in] パス文字列
        //--------------------------------------------------------------
        Path(const std::string& path)
            : m_path(Normalize(path)) {}

        //--------------------------------------------------------------
        //! @brief  パス文字列を取得する関数
        //! @return パス文字列
        //--------------------------------------------------------------
        const std::string& string() const noexcept { return m_path; }

        //--------------------------------------------------------------
        //! @brief  パスの親ディレクトリを取得する関数
        //! @return 親ディレクトリのパス
        //--------------------------------------------------------------
        Path parent() const { return Path(std::filesystem::path(m_path).parent_path().generic_string()); }

        //--------------------------------------------------------------
        //! @brief  パスのファイル名を取得する関数
        //! @return ファイル名
        //--------------------------------------------------------------
        std::string filename() const { return std::filesystem::path(m_path).filename().string(); }

        //-----------------------------------------------------------
        //! @brief  パスを結合する演算子
        //! @param  rhs [in] 結合するパス要素
        //! @return 結合後のパス
        //-----------------------------------------------------------
        Path operator/(const std::string& rhs) const { return Path((std::filesystem::path(m_path) / rhs).generic_string()); }

    private:
        std::string m_path;    // 正規化されたパス文字列

        //--------------------------------------------------------------
        //! @brief  パスを正規化する関数
        //! @param  path [in] 正規化する前のパス文字列
        //! @return 正規化されたパス文字列
        //--------------------------------------------------------------
        static std::string Normalize(const std::string& path) { return std::filesystem::path(path).generic_string(); }
    };
}    // namespace Tsukino::Core
