//--------------------------------------------------------------
//! @file	AssetHandle.hpp
//! @brief  アセットハンドルの定義
//! @author 山﨑愛
//--------------------------------------------------------------
#pragma once
#include <Tsukino/Core/typedef.hpp>
// 名前空間 : Tsukino::Asset
namespace Tsukino::Asset {
    //--------------------------------------------------------------
    //! @class  AssetHandle
    //! @brief  アセットハンドルクラス
    //--------------------------------------------------------------
    class AssetHandle {
    public:
        //--------------------------------------------------------------
        //! @brief デフォルトコンストラクタ
        //--------------------------------------------------------------
        AssetHandle() = default;

        //--------------------------------------------------------------
        //! @brief 引数付きコンストラクタ
        //! @param value [in] ハンドルの値
        //--------------------------------------------------------------
        explicit AssetHandle(u64 value)
            : m_value(value) {}

        //--------------------------------------------------------------
        //! @brief  値を取得する関数
        //! @return ハンドルの値
        //--------------------------------------------------------------
        u64  Value() const { return m_value; }

        //--------------------------------------------------------------
        //! @brief  ハンドルが有効か確認する関数
        //! @return true: 有効, false: 無効
        //--------------------------------------------------------------
        bool          IsValid() const { return m_value != 0; }

        //--------------------------------------------------------------
        //! @brief  同一のハンドルか比較する演算子オーバーロード
        //! @param  other [in] 比較対象のハンドル
        //! @return true: 同一, false: 異なる
        //--------------------------------------------------------------
        bool operator==(const AssetHandle& other) const { return m_value == other.m_value; }
        
        //--------------------------------------------------------------
        //! @brief  異なるハンドルか比較する演算子オーバーロード
        //! @param  other [in] 比較対象のハンドル
        //! @return true: 異なる, false: 同一
        //--------------------------------------------------------------
        bool operator!=(const AssetHandle& other) const { return !(*this == other); }

    private:
        u64 m_value = 0;    // ハンドルの値
    };

}    // namespace Tsukino::Asset
