//--------------------------------------------------------------
//! @file	IAsset.hpp
//! @brief  アセットの共通インターフェース
//! @author 山﨑愛
//--------------------------------------------------------------
#pragma once
#include <Tsukino/Engine/Asset/AssetHandle.hpp>
#include <Tsukino/Engine/Asset/AssetType.hpp>
// 名前空間 : Tsukino::Asset
namespace Tsukino::Asset {
    //--------------------------------------------------------------
    //! @class IAsset
    //! @brief アセットの共通インターフェース
    //--------------------------------------------------------------
    class IAsset {
    public:
        //--------------------------------------------------------------
        //! @brief 仮想デストラクタ
        //--------------------------------------------------------------
        virtual ~IAsset() = default;

        //--------------------------------------------------------------
        //! @brief  アセットのハンドルを取得する関数
        //! @return アセットのハンドル
        //--------------------------------------------------------------
        virtual AssetHandle GetHandle() const = 0;

        //--------------------------------------------------------------
        //! @brief  アセットの種類を取得する関数
        //! @return アセットの種類
        //--------------------------------------------------------------
        virtual AssetType GetType() const = 0;
    };
}    // namespace Tsukino::Asset
