//--------------------------------------------------------------
//! @file   PrimitiveMesh.vs.hlsl
//! @brief  プリミティブメッシュ用 頂点シェーダ
//! @author 山﨑愛
//--------------------------------------------------------------

//--------------------------------------------------------------
// 定数バッファ：変換行列
//--------------------------------------------------------------
cbuffer TransformBuffer : register(b0)
{
    float4x4 u_MVP; // モデル × ビュー × プロジェクション行列
};

//--------------------------------------------------------------
// 入力構造体
//--------------------------------------------------------------
struct VSInput
{
    float3 position : POSITION;
    float2 uv : TEXCOORD0;
};

//--------------------------------------------------------------
// 出力構造体
//--------------------------------------------------------------
struct VSOutput
{
    float4 position : SV_POSITION;
    float2 uv : TEXCOORD0;
};

//--------------------------------------------------------------
//! @brief プリミティブメッシュ用頂点シェーダー
//! @param input [in] 頂点シェーダーの入力
//! @return 出力構造体
//--------------------------------------------------------------
VSOutput VSMain(VSInput input)
{
    VSOutput output;
    output.position = mul(float4(input.position, 1.0f), u_MVP);
    output.uv = input.uv;
    return output;
}
